In [1]:
people = {
    'first': ['Corey', 'Jane', 'John'], 
    'last': ['Schafer', 'Doe', 'Doe'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [16]:
import pandas as pd

In [17]:
df = pd.DataFrame(people)

In [18]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [19]:
df['first'] + ' ' + df['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [20]:
# Adding a new column
# This will create a new column called 'full_name' in the DataFrame 'df', where each row will contain 
# the concatenated 'first' and 'last' names separated by a space.

df['full_name'] = df['first'] + ' ' + df['last']

In [21]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [22]:
# The code you provided is used to drop the columns 'first' and 'last' from a pandas DataFrame 'df' in place. 
# When you set inplace=True, it means the DataFrame 'df' will be modified directly, and the specified columns 
# will be removed.

df.drop(columns=['first', 'last'], inplace=True)

In [23]:
df

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [24]:
df['full_name'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [27]:
# df['full_name']: This selects the 'full_name' column from the DataFrame 'df'.
# .str.split(' ', expand=True): This applies the split method to each element in the 'full_name' column, 
# splitting it into parts using a space (' ') as the separator. 
# The expand=True argument tells pandas to expand the result into separate columns.

df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [28]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [30]:
people = {
    'first': ['Tony', 'Steve'], 
    'last': ['Stark', 'Rogers'], 
    'email': ['IronMan@avenge.com', 'Cap@avenge.com']
}
df2 = pd.DataFrame(people)

In [31]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [36]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [38]:
# Use the concat function to concatenate DataFrames. 
# Assuming df and df2 are your DataFrames

result_df = pd.concat([df, df2], ignore_index=True, sort=False)
result_df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [44]:
result_df.drop(index=4)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark

In [46]:
filt = result_df['last'] == 'Doe'
filt

0    False
1     True
2     True
3    False
4    False
Name: last, dtype: bool

In [48]:
result_df.drop(index=result_df[filt].index)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers